In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("abc.csv")

In [3]:
print(df)

    name   marks          city
0   Ahmed     90        lahore
1  Wajhat     98      islambad
2  Muneeb     89  changa_manga
3  Hafeez     99           xyz
4   Tashi     87           abc

In [4]:
weather_data = {
        'day': ['3/1/2017','2/2/2013' , '6/8/2015'],
        'temperature' : [16 , 14 ,21],
        'windspeed' : [600 , 450 , 500],
        'event' : ['rain', 'cloudey','sunney']
}
df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed    event
0  3/1/2017           16        600     rain
1  2/2/2013           14        450  cloudey
2  6/8/2015           21        500   sunney

In [5]:
row , coloums = df.shape
row

3

In [6]:
df.head(2)

        day  temperature  windspeed    event
0  3/1/2017           16        600     rain
1  2/2/2013           14        450  cloudey

In [7]:
df[2:]

        day  temperature  windspeed   event
2  6/8/2015           21        500  sunney

In [8]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [9]:
df[['event', 'day']]

     event       day
0     rain  3/1/2017
1  cloudey  2/2/2013
2   sunney  6/8/2015

In [10]:
df['temperature'].std()

3.605551275463989

In [11]:
df.describe()

       temperature   windspeed
count     3.000000    3.000000
mean     17.000000  516.666667
std       3.605551   76.376262
min      14.000000  450.000000
25%      15.000000  475.000000
50%      16.000000  500.000000
75%      18.500000  550.000000
max      21.000000  600.000000

In [12]:
df[df.temperature >= 10]

        day  temperature  windspeed    event
0  3/1/2017           16        600     rain
1  2/2/2013           14        450  cloudey
2  6/8/2015           21        500   sunney

In [13]:
df[df.temperature == df.temperature.max()]

        day  temperature  windspeed   event
2  6/8/2015           21        500  sunney

In [14]:
df.set_index('day' , inplace = True)

In [15]:
df

          temperature  windspeed    event
day
3/1/2017           16        600     rain
2/2/2013           14        450  cloudey
6/8/2015           21        500   sunney

In [16]:
df.loc['3/1/2017']

temperature      16
windspeed       600
event          rain
Name: 3/1/2017, dtype: object

In [17]:
df.reset_index(inplace = True)

In [18]:
df

        day  temperature  windspeed    event
0  3/1/2017           16        600     rain
1  2/2/2013           14        450  cloudey
2  6/8/2015           21        500   sunney

In [20]:
df = pd.read_excel('check.xlsx','Sheet1')
df

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,NaN,NaN,Unnamed: 0,day,Temperature,windspeed,event
1,NaN,NaN,0,2017-03-01 00:00:00,16,600,rain
2,NaN,NaN,1,2013-02-02 00:00:00,14,450,cloudey
3,NaN,NaN,2,2015-06-08 00:00:00,n.a.,500,sunney

In [21]:
weather_data = [
    ('2017-03-01',16,600,'rain'),
    ('2013-02-02',14,450,'cloudey'),
    ('2015-06-08',21,500,'sunney')
]
df = pd.DataFrame(weather_data , columns=['day','temperature','windspeed','event'])
df

          day  temperature  windspeed    event
0  2017-03-01           16        600     rain
1  2013-02-02           14        450  cloudey
2  2015-06-08           21        500   sunney

In [22]:
df = pd.read_csv('xyz.csv')
df

  records Unnamed: 1    Unnamed: 2
0   name       marks          city
1   Ahmed         90        lahore
2  Wajhat         98      islambad
3  Muneeb         89  changa_manga
4  Hafeez         99           xyz
5   Tashi         87           abc

In [23]:
df = pd.read_csv('xyz.csv',skiprows = 1)
df

    name   marks          city
0   Ahmed     90        lahore
1  Wajhat     98      islambad
2  Muneeb     89  changa_manga
3  Hafeez     99           xyz
4   Tashi     87           abc

In [24]:
df = pd.read_csv('xyz.csv' , header = 1)
df

    name   marks          city
0   Ahmed     90        lahore
1  Wajhat     98      islambad
2  Muneeb     89  changa_manga
3  Hafeez     99           xyz
4   Tashi     87           abc

In [25]:
df = pd.read_csv('xyz.csv' , header = None , names =["name","marks","city"] )
df

      name  marks          city
0  records    NaN           NaN
1    name   marks          city
2    Ahmed     90        lahore
3   Wajhat     98      islambad
4   Muneeb     89  changa_manga
5   Hafeez     99           xyz
6    Tashi     87           abc

In [26]:
df = pd.read_csv("abc.csv" , nrows = 3) ##read 3 rows excluding header
df

    name   marks          city
0   Ahmed     90        lahore
1  Wajhat     98      islambad
2  Muneeb     89  changa_manga

In [27]:
df = pd.read_csv("abc.csv" , na_values=["not avalible","n.a."])  ##use for cleaning data

In [28]:
df.to_csv('new.csv' , index = False)

In [29]:
df.columns

Index(['name ', 'marks', 'city'], dtype='object')

In [30]:
df.to_csv("new.csv",columns = ['name' , 'city'] , index = False)

C:\Users\Ahmed\Anaconda3\lib\site-packages\pandas\core\indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

In [31]:
df.to_csv("new.csv",header =False)

In [32]:
def covert_event_cell(cell):
    if cell == "n.a.":
        return "cloudey"
    return cell

df = pd.read_excel("check.xlsx" , "Sheet1" , converters = {   ## converters use for changing a specific cell
    'event': covert_event_cell
})

df

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,NaN,NaN,Unnamed: 0,day,Temperature,windspeed,event
1,NaN,NaN,0,2017-03-01 00:00:00,16,600,rain
2,NaN,NaN,1,2013-02-02 00:00:00,14,450,cloudey
3,NaN,NaN,2,2015-06-08 00:00:00,n.a.,500,sunney

In [33]:
df.to_excel("check.xlsx" ,sheet_name ="wather" ,startrow = 1 , startcol = 2, index = False)

In [37]:
df_1 = pd.read_excel("check.xlsx" , "wather")
df_2 = pd.read_excel("check2.xlsx" , "wather")

In [39]:
with pd.ExcelWriter('murge.xlsx') as writer:
    df_1.to_excel(writer , sheet_name = "W1")
    df_2.to_excel(writer , sheet_name = "W2")